<a href="https://colab.research.google.com/github/Kpranay3151/Python-Basics-Conditional-Loops/blob/main/Datacleaning_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [235]:
import pandas as pd
import numpy as np

In [236]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [237]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [238]:
#1
for i in range(1, df['FlightNumber'].count() + 1):
      if pd.isnull(df.loc[i,'FlightNumber']):
          df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber'] + 10

In [239]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [240]:
df['FlightNumber'].astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [241]:
#2
temp= df

In [242]:
temp[['From','To']] = temp.From_To.str.split("_",expand=True)

In [243]:
temp=temp.drop("From_To",axis=1)
temp

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1       10055.0            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [244]:
#3
for i in range(0, temp['From'].count()):
  temp.loc[i, 'From'] = temp.loc[i, 'From'].capitalize()

In [245]:
temp

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      paris
1       10055.0            []    <Air France> (12)    Madrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    London  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [246]:
#4
df.drop("From_To",axis=1)

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1       10055.0            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [247]:
#5
n=0
for i in range(0, temp['RecentDelays'].count()):
  if len(temp.loc[i, 'RecentDelays'])>n:
         n=len(temp.loc[i, 'RecentDelays'])
print(n)

3

In [251]:
temp["RecentDelays"].apply(pd.Series)

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [266]:
temp=pd.merge(temp.drop("RecentDelays",axis=1),temp["RecentDelays"].apply(pd.Series),left_index=True,right_index=True)

In [270]:
temp.rename(columns = {0:'delay_1', 1:'delay_2',
                              2:'delay_3'}, inplace = True)

In [272]:
temp

   FlightNumber              Airline      From  ... delay_1  delay_2  delay_3
0       10045.0               KLM(!)    London  ...    23.0     47.0      NaN
1       10055.0    <Air France> (12)    Madrid  ...     NaN      NaN      NaN
2       10065.0  (British Airways. )    London  ...    24.0     43.0     87.0
3       10075.0       12. Air France  Budapest  ...    13.0      NaN      NaN
4       10085.0          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]